# Содержание
[Глоссарий](#Глоссарий)  
1. [Введение](#1Введение)  
1.1 [Назначение](#11-Назначение)  
1.2 [Соглашения, принятые в документе](#12-Соглашения-принятые-в-документе)  
1.3 [Область действия проекта](#13-Область-действия-проекта)  
1.4 [Аналоги разрабатываемого проекта](#14-Аналоги-разрабатываемого-проекта)  
2. [Общее описание](#2-Общее-описание)  
2.1 [Функционал продукта](#22-Функционал-продукта)  
2.2 [Классификация пользователей](#23-Классификация-пользователей)  
2.3 [Операционная среда](#24-Операционная-среда)  
2.4 [Инструментарий проектирования](#25-Инструментарий-проектирования)  
2.5 [Предполагаемые зависимости](#26-Предполагаемые-зависимости)  
3. [Требования к интерфейсу](#3-Требования-к-интерфейсу)  
3.1 [Пользовательский интерфейс](#31-Пользовательский-интерфейс)  
3.2 [Интерфейс связи](#33-Интерфейс-связи)  
4. [Функциональные особенности системы](#4-Функциональные-особенности-системы)  
5. [Нефункциональные особенности](#5-Нефункциональные-особенности)  
5.1 [Атрибуты качества](#52-Атрибуты-качества)  
# Глоссарий 
- Story: Path of Hero – игра в жанре roguelike и метроидвания.  
- Roguelike— жанр компьютерных игр, поджанр компьютерных ролевых игр. Характерными особенностями roguelike являются генерируемые случайным образом уровни и необратимость смерти персонажа — в случае его гибели игрок не может загрузить игру и должен начать её заново. 
 - Метроидвания— жанр компьютерных игр, поджанр приключенческого боевика. Отличительной особенностью является: большой связный мир, который можно исследовать, хотя доступ к некоторым его частям перекрыт дверями, «нехваткой информации» и различными барьерами, которые можно будет преодолеть, подобрав в другом месте мира подходящий инструмент или способность. Сбор этих улучшений также поможет герою побеждать более сложных врагов, находить секретные места и проходы, а также с лёгкостью ходить в местах, где герой уже был. Сюжет и геймплей в метроидвании, как правило, искусно переплетены.  
 - Лаунчер -это программная оболочка, основной задачей которой является удобный запуск приложений.
 - fps - (frame per second) кол-во кадров секунду.
# 1. Введение
## 1.1 Назначение 
В рамках данной спецификации требований программного обеспечения описывается назначение и область действия данного приложения. Также цель документа состоит в анализе и в получении глубокого понимания функционала игры SPoH, сборке всех различных идей, определении системы, ее требований по отношению к потребителям. Также будут изложены концепции, которые будут разработаны позже, и будут документрироваться идеи, которые будут рассмотрены, но могут быть отброшены по мере развития продукта.
## 1.2 Соглашения, принятые в документе
SPoH – Story: Path of Hero(История: Путь героя)
## 1.3 Область действия проекта
Данный проект является 2D игрой, идея которой заключается в сражении с монстрами. Для облегчения игрового процесса предоставляется возможность сбора предметов. Данная игра рекомендутся для аудитории старше 16 лет.
## 1.4 Аналоги разрабатываемого проекта
*[Dead cells](https://store.steampowered.com/app/588650/Dead_Cells/)*- компьютерная игра в смешанном жанре roguelike и метроидвании В ходе Dead Cells игрок управляет существом, пытающемся выбраться из лабиринта. Уровни игры, выполненные в духе двухмерного платформера, генерируются процедурным образом; по ним разбросаны враги и различные сокровища, в том числе оружие со случайно генерируемыми характеристиками. Подобно играм в жанре roguelike, у персонажа Dead Cells только одна «жизнь» — если он погибнет, игрок будет вынужден начать игру с самого начала. Некоторые единожды полученные способности, открывающие доступ к новым, ранее недоступным областям игры, переносятся и в последующие прохождения.
# 2 Общее описание
## 2.1 Функционал продукта  
Данная игра позволит игроку проходить процедурно генерируемые локации, в которых игрок сможет сражаться с монстрами, различными способами(торговля и собирательство) добывать снаряжение для улучшения игрового персонажа.
## 2.2 Классификация пользователей 
 - Игроки, которым нравятся жанр roguelike или метроидвания;
 - Игроки, которые хотят попробавть для себя новый жанр.
## 2.3 Операционная среда
Операционная система: UNIX - подобные, семейство Microsoft Windows.
## 2.4 Инструментарий разработки
Игровой движок: Unity 2018.4;  
Используемый язык программирования: C#.
## 2.5 Предполагаемые зависимости 
Приложение будет работать при наличии DirectX 11 и видеокарты с поддержкой Shader Model 4.0 и выше.  
# 3. Требования к интерфейсу

## 3.1 Пользовательский интерфейс  
Игровой лаунчер с графическими настройками  
![](https://github.com/KabarykhaVictor750504/ProjectX/blob/master/Mackup/GameLaucher(Graphics).png)  
Игровой лаунчер с настройками управления 

![](https://github.com/KabarykhaVictor750504/ProjectX/blob/master/Mackup/GameLaucher(Input).png)  
Главное меню  ![Главное меню](https://github.com/KabarykhaVictor750504/ProjectX/blob/master/Mackup/MainMenu.png)  
Примерное представление прыжка(стрелки в самой игре не будет)  ![Примерное представление прыжка(стрелки в самой игре не будет](https://github.com/KabarykhaVictor750504/ProjectX/blob/master/Mackup/JumpAndWalk.png)  
Примерное представление атаки и блока  ![Примерное представление атаки и блока](https://github.com/KabarykhaVictor750504/ProjectX/blob/master/Mackup/BlockAndAtack.png)  
Меню паузы  ![Меню паузы](https://github.com/KabarykhaVictor750504/ProjectX/blob/master/Mackup/GameMenu.png)  
Инвентарь героя  ![Инвентарь героя](https://github.com/KabarykhaVictor750504/ProjectX/blob/master/Mackup/Inventory.png)  
# 4. Функциональные требования 
 - Начать игру;
 - Выйти из игры;
 - Процедурно генерируемые локации;
 - Сбор предметов для улучшения показателей героя;
 - Покупка предметов у торговцев;
 - Сражение с монстрами для прохождения уровней;   
# 5. Нефункциональные особенности  
## 5.1 Атрибуты качества  
 - Возможность настроить управление;   
  

